# IsMovable Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Connector..::..IsMovable Property
Connector Class See Also
---
whether the connector can be moved.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsMovable { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsMovable As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsMovable {
	bool get ();
}
```

# Remarks
Only connectors of type EndConn can be moved.
# See Also
Connector Class
Autodesk.Revit.DB Namespace